code/app/Controllers/Dashboard.php

    public function profile()
    {
        $session = session();
        if (!$session->get('isLoggedIn')) { return redirect()->to('/login'); }

        $db = \Config\Database::connect();

        $userId = $session->get('id');
        $userModel = new \App\Models\UserModel($db);
        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '2'