code/app/Controllers/SecureLogin.php

SELECT *
FROM `users`
WHERE `username` = 'mhs01'
AND `password` = 'mhs123'
---
    public function auth()
    {
        $session = session();
        $db = \Config\Database::connect();

        // 1. Ambil Input
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // [THE FORTRESS - SECURITY PATCH]
        // Menggunakan Query Builder CI4.
        // CodeIgniter secara otomatis melakukan 'escaping' pada input ini.
        // Input 'admin OR 1=1' akan dianggap sebagai STRING username semata,
        // bukan perintah logika SQL.

        $user = $db->table('users')
                   ->where('username', $username)
                   ->where('password', $password) // Catatan: Idealnya password di-hash, tapi untuk demo SQLi, plain text oke.
                   ->get()
                   ->getRow();