app/Controllers/AdminController.php

SELECT *
FROM `users`
SELECT *
FROM `fakultas`
SELECT *
FROM `jurusan`
JOIN `fakultas` ON `fakultas`.`id_fakultas` = `jurusan`.`id_fakultas`
SELECT `prodi`.*, `jurusan`.`nama_jurusan`, `users`.`nama_user` as `nama_kaprodi`
FROM `prodi`
JOIN `jurusan` ON `jurusan`.`id_jurusan` = `prodi`.`id_jurusan`
LEFT JOIN `users` ON `users`.`id_user` = `prodi`.`id_user_kaprodi`
SELECT *
FROM `mahasiswa`
LEFT JOIN `users` ON `users`.`id_user` = `mahasiswa`.`id_user`
---
    public function index()
    {
        $data = [
            'nama_user' => session()->get('nama_user'),
            'role'      => session()->get('role'),

            // Mengambil Data untuk Dropdown & Tabel
            'users'     => $this->db->table('users')->get()->getResultArray(),
            'fakultas'  => $this->db->table('fakultas')->get()->getResultArray(),
            'jurusan'   => $this->db->table('jurusan')
                                    ->join('fakultas', 'fakultas.id_fakultas = jurusan.id_fakultas')
                                    ->get()->getResultArray(),
            'prodi'     => $this->db->table('prodi')
                                    ->join('jurusan', 'jurusan.id_jurusan = prodi.id_jurusan')
                                    ->join('users', 'users.id_user = prodi.id_user_kaprodi', 'left')
                                    ->select('prodi.*, jurusan.nama_jurusan, users.nama_user as nama_kaprodi')
                                    ->get()->getResultArray(),
            'mahasiswa' => $this->db->table('mahasiswa')
                                    ->join('users', 'users.id_user = mahasiswa.id_user', 'left')
                                    ->get()->getResultArray()